
## :white_check_mark: Apply Succeeded (pocket-event-bridge-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/23661)



<pre><code>Apply complete! Resources: 13 added, 2 changed, 2 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8: Refreshing state... [id=PBG94PI]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0: Refreshing state... [id=P05Z5UR]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715: Refreshing state... [id=PFSX528]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7: Refreshing state... [id=PJ1I5EY]
aws_sns_topic.list-api-events_list-event-topic_8792A1B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ListEventTopic]
aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Dev-Shared-Event-Bus_49D29B26: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus]
aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-UserMerge-SNS-Topic-DLQ]
aws_cloudwatch_event_rule.user-registration_PocketEventBridge-Dev-User-Registration-EventBridge-Rule_event-bridge-rule_57265A16: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserRegistration-Rule-Rule]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue_9971A44C: Reading...
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue_9971A44C: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue]
aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-ShareableListEvents-Topic-DLQ]
aws_sns_topic.user-api-events_user-event-topic_BF85AC87: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic]
aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3: Refreshing state... [id=User-Registration-Event/PocketEventBus]
aws_sns_topic.shareable-list-item-events_shareable-list-item-event-topic_C6825838: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListItemEventTopic]
aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33: Refreshing state... [id=user-events/PocketEventBus]
aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59: Refreshing state... [id=Premium-Purchase/PocketEventBus]
data.terraform_remote_state.incident_management: Read complete after 1s
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_46A95BB9: Refreshing state... [id=PocketEventBridge-Dev-UserMerge-Rule-Rule]
aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60: Refreshing state... [id=queue-check-delete/PocketEventBus]
aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ListApiEvents-Topic-Rule-DLQ]
data.aws_sqs_queue.prospect-events_prospect-Dev-dlq_437725F7: Reading...
aws_sns_topic.collection-events_collection-event-topic_343F754D: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-CollectionEventTopic]
data.aws_sqs_queue.prospect-events_prospect-Dev-queue_E020D8EE: Reading...
data.aws_sqs_queue.prospect-events_prospect-Dev-dlq_437725F7: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue-Deadletter]
aws_sns_topic.prospect-events_prospect-event-topic_59EF07AC: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ProspectEventTopic]
data.aws_sqs_queue.prospect-events_prospect-Dev-queue_E020D8EE: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue]
aws_sns_topic.premium-purchase_premium-purchase-topic_B49B01E4: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-PremiumPurchase-Topic]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue-dlq_67C0CEB2: Reading...
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Dev-queue-dlq_67C0CEB2: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue-Deadletter]
aws_sns_topic.user-registration_user-registration-topic_1A7AE012: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserRegistrationTopic]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Critical]
aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Dev-PremiumPurchase-EventBridge-Rule_event-bridge-rule_7735469E: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-PremiumPurchase-Rule-Rule]
aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B: Refreshing state... [id=user-merge/PocketEventBus]
aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-CollectionEvents-Event-Rule-DLQ]
aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D: Refreshing state... [id=Forgot-Password-Request/PocketEventBus]
aws_sns_topic.adm-events_user-merge-topic_59FD8EDC: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserMerge-Topic]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Non-Critical]
aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-UserEvents-Topic-Rule-DLQ]
aws_sqs_queue.user-registration_sns-topic-dql_811A5411: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-UserRegistration-Topic--DLQ]
aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-ShareableListItemEvents-Topic-DLQ]
aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419: Refreshing state... [id=Premium-Renewal-Upcoming/PocketEventBus]
aws_sns_topic.shareable-list-events_shareable-list-event-topic_0122F098: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListEventTopic]
aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-PremiumPurchase-SNS-Topic-Event-Rule-DLQ]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Dev-EventTracker-EventBridge-Rule_event-bridge-rule_4E64BB98: Refreshing state... [id=PocketEventBridge-Dev-EventTracker-Rule-Rule]
aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Dev-User-Api-EventBridge-Rule_event-bridge-rule_CD10601E: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserEvents-Rule-Rule]
aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Dev-Shareable-List-EventBridge-Rule_event-bridge-rule_8AF00B8D: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ShareableListEvents-Rule-Rule]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Dev-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_3EB93B4A: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ShareableListItemEvents-Rule-Rule]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Dev-Prospect-Prod-EventBridge-Rule_event-bridge-rule_61DEA3A5: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ProspectEvents-Rule-Rule]
aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Dev-Collection-Api-EventBridge-Rule_event-bridge-rule_FF7503E5: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-CollectionEvents-Rule-Rule]
aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Dev-List-Api-EventBridge-Rule_event-bridge-rule_0EE34A09: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-ListApiEvents-Rule-Rule]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Dev-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_A86C3809: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-Prospect-Dismiss-Event-Rule-Rule]
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_56495939: Reading...
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_56495939: Read complete after 0s [id=1536945497]
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_09BB5CFB: Reading...
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Refreshing state... [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_09BB5CFB: Read complete after 0s [id=1858380603]
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_84ACA1D5: Reading...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PP09GUZ]
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_84ACA1D5: Read complete after 0s [id=4158017153]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=P8QLFF9]
aws_cloudwatch_metric_alarm.prospect-events_prospectevents-rule-dlq-alarm_8841D120: Refreshing state... [id=PocketEventBridge-Dev-ProspectEvents-Rule-DLQ-Alarm]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-Prospect-Event-SQS-Policy_A24BDD58: Reading...
aws_cloudwatch_metric_alarm.list-api-events_listapievents-rule-dlq-alarm_9E16078F: Refreshing state... [id=PocketEventBridge-Dev-ListApiEvents-Rule-dlq-alarm]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-Prospect-Event-SQS-Policy_A24BDD58: Read complete after 0s [id=2939629240]
data.aws_iam_policy_document.collection-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_7E9EBC8B: Reading...
data.aws_iam_policy_document.collection-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_7E9EBC8B: Read complete after 0s [id=558847036]
aws_cloudwatch_metric_alarm.adm-events_pocketeventbridge-dev-dlq-alarm_BCAE7713: Refreshing state... [id=PocketEventBridge-Dev-PocketEventBridge-Dev-Dlq-Alarm]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_3BE5D0A5: Reading...
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_3BE5D0A5: Read complete after 0s [id=4079020960]
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Dev-EventBridge-SNS-Policy_A531B333: Reading...
null_resource.user-registration_null-resource_B04CACC3: Refreshing state... [id=2164411739781809868]
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Dev-EventBridge-SNS-Policy_A531B333: Read complete after 0s [id=2786568925]
data.aws_iam_policy_document.user-registration_PocketEventBridge-Dev-EventBridge-SNS-Policy_5C4372D1: Reading...
data.aws_iam_policy_document.user-registration_PocketEventBridge-Dev-EventBridge-SNS-Policy_5C4372D1: Read complete after 0s [id=398711402]
null_resource.premium-purchase_null-resource_E2C3B0AC: Refreshing state... [id=2431405901146229294]
aws_cloudwatch_metric_alarm.collection-events_collectionevents-rule-dlq-alarm_9543404D: Refreshing state... [id=PocketEventBridge-Dev-CollectionEvents-Rule-dlq-alarm]
data.aws_iam_policy_document.adm-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E5FB144D: Reading...
data.aws_iam_policy_document.adm-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E5FB144D: Read complete after 0s [id=2368812478]
null_resource.adm-events_null-resource_C7D19F6F: Refreshing state... [id=686595610515218195]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Dev-UserMerge-Rule-Target_464B97D5: Refreshing state... [id=PocketEventBridge-Dev-UserMerge-Rule-Rule-AccountDeleteMonitor-Dev-UserMerge-Rule-Target]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E3B52D6F: Reading...
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Dev-EventBridge-SNS-Policy_E3B52D6F: Read complete after 0s [id=3177284822]
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Refreshing state... [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_metric_alarm.user-api-events_userevents-rule-dlq-alarm_A6972B78: Refreshing state... [id=PocketEventBridge-Dev-UserEvents-Rule-dlq-alarm]
aws_cloudwatch_event_target.user-registration_PocketEventBridge-Dev-User-Registration-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-User-Registration-Event-SNS-Target_5050627A: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-UserRegistration-Rule-Rule-PocketEventBridge-Dev-User-Registration-Event-SNS-Target]
null_resource.user-api-events_null-resource_C0C836FA: Refreshing state... [id=2732232843318932070]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Dev-EventTracker-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Dev-EventTracker-Rule-Target_0FA8570E: Refreshing state... [id=PocketEventBridge-Dev-EventTracker-Rule-Rule-AccountDeleteMonitor-Dev-EventTracker-Rule-Target]
aws_cloudwatch_metric_alarm.premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2: Refreshing state... [id=PocketEventBridge-Dev-PremiumPurchase-rule-dlq-alarm]
aws_cloudwatch_event_target.premium-purchase_PocketEventBridge-Dev-PremiumPurchase-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-PremiumPurchase-SNS-Target_16A7E60C: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-PremiumPurchase-Rule-Rule-PocketEventBridge-Dev-PremiumPurchase-SNS-Target]
aws_cloudwatch_event_target.user-api-events_PocketEventBridge-Dev-User-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-User-Event-SNS-Target_AC72C0FA: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-UserEvents-Rule-Rule-PocketEventBridge-Dev-User-Event-SNS-Target]
null_resource.shareable-list-events_null-resource_78AB9CC2: Refreshing state... [id=7514281831826198604]
null_resource.collection-events_null-resource_9F908E27: Refreshing state... [id=832091505403206886]
aws_cloudwatch_event_target.collection-events_PocketEventBridge-Dev-Collection-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Collection-Event-SNS-Target_FEA1C077: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-CollectionEvents-Rule-Rule-PocketEventBridge-Dev-Collection-Event-SNS-Target]
aws_cloudwatch_event_target.shareable-list-events_PocketEventBridge-Dev-Shareable-List-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Shareable-List-Event-SNS-Target_516DAD68: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ShareableListEvents-Rule-Rule-PocketEventBridge-Dev-Shareable-List-Event-SNS-Target]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Dev-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Prospect-Event-SNS-Target_594EAF60: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-Prospect-Dismiss-Event-Rule-Rule-PocketEventBridge-Dev-Prospect-Event-SNS-Target]
null_resource.prospect-events_null-resource_BF542108: Refreshing state... [id=73097855203687419]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Dev-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Prospect-Event-SQS-Target_21AE1E27: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ProspectEvents-Rule-Rule-PocketEventBridge-Dev-Prospect-Event-SQS-Target]
aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ListEventTopic]
aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic]
aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListItemEventTopic]
null_resource.list-api-events_null-resource_D711C801: Refreshing state... [id=4790634215299972220]
null_resource.shareable-list-item-events_null-resource_46056FE2: Refreshing state... [id=7821674224914414466]
aws_cloudwatch_event_target.shareable-list-item-events_PocketEventBridge-Dev-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-Shareable-List-Item-Event-SNS-Target_BCC10972: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ShareableListItemEvents-Rule-Rule-PocketEventBridge-Dev-Shareable-List-Item-Event-SNS-Target]
aws_cloudwatch_event_target.list-api-events_PocketEventBridge-Dev-List-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Dev-List-Event-SNS-Target_AEFA7A5C: Refreshing state... [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-ListApiEvents-Rule-Rule-PocketEventBridge-Dev-List-Event-SNS-Target]
aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue]
aws_sns_topic_policy.collection-events_collection-events-sns-topic-policy_65FE0430: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-CollectionEventTopic]
aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ProspectEventTopic]
aws_sns_topic_policy.user-registration_user-registration-events-sns-topic-policy_15EC0C3C: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserRegistrationTopic]
aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-PremiumPurchase-Topic]
aws_sns_topic_policy.adm-events_user-events-sns-topic-policy_311E9FD7: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserMerge-Topic]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Non-Critical:8f1d27da-5169-4a2f-b880-6bbc667bfe80]
aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE: Refreshing state... [id=arn:aws:sns:us-east-1:41031

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

f2c4b04/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Non-Critical:8f1d27da-5169-4a2f-b880-6bbc667bfe80" -> (known after apply)
      ~ owner_id                        = "410318598490" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_admevents_snstopicdql_43476306 has moved to aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB
    resource "aws_sqs_queue" "adm-events_sns-topic-dql_3950AFFB" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-UserMerge-SNS-Topic-DLQ"
        name                              = "PocketEventBridge-Dev-UserMerge-SNS-Topic-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_collectionevents_snstopicdql_6B11F7F7 has moved to aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3
    resource "aws_sqs_queue" "collection-events_sns-topic-dql_48DE5FA3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-CollectionEvents-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Dev-SNS-CollectionEvents-Event-Rule-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_listapievents_snstopicdql_0098EEA6 has moved to aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54
    resource "aws_sqs_queue" "list-api-events_sns-topic-dql_ED0C2F54" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-ListApiEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Dev-ListApiEvents-Topic-Rule-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_premiumpurchase_snstopicdlq_1949C943 has moved to aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E
    resource "aws_sqs_queue" "premium-purchase_sns-topic-dlq_2D01673E" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Dev-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_shareablelistevents_snstopicdql_49BECACA has moved to aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3
    resource "aws_sqs_queue" "shareable-list-events_sns-topic-dql_91DFF5B3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-ShareableListEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Dev-SNS-ShareableListEvents-Topic-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_shareablelistitemevents_snstopicdql_D0F47B59 has moved to aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F
    resource "aws_sqs_queue" "shareable-list-item-events_sns-topic-dql_44435A2F" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-ShareableListItemEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Dev-SNS-ShareableListItemEvents-Topic-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_userapievents_snstopicdql_A0F6EC9F has moved to aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53
    resource "aws_sqs_queue" "user-api-events_sns-topic-dql_D6161F53" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-UserEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Dev-UserEvents-Topic-Rule-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_userregistration_snstopicdql_5EDA4814 has moved to aws_sqs_queue.user-registration_sns-topic-dql_811A5411
    resource "aws_sqs_queue" "user-registration_sns-topic-dql_811A5411" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/PocketEventBridge-Dev-SNS-UserRegistration-Topic--DLQ"
        name                              = "PocketEventBridge-Dev-SNS-UserRegistration-Topic--DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E will be created
  # (moved from aws_sqs_queue_policy.pocketeventbridge_prospectevents_prospecteventssqspolicy_B5651E17)
  + resource "aws_sqs_queue_policy" "prospect-events_prospect-events-sqs-policy_5D878A3E" {
      + id        = (known after apply)
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:410318598490:ProspectAPI-Dev-Sqs-Translation-Queue"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + queue_url = "https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue"
    }

  # null_resource.pocketeventbridge_admevents_nullresource_582607DC has moved to null_resource.adm-events_null-resource_C7D19F6F
    resource "null_resource" "adm-events_null-resource_C7D19F6F" {
        id = "686595610515218195"
    }

  # null_resource.pocketeventbridge_collectionevents_nullresource_DC135E6D has moved to null_resource.collection-events_null-resource_9F908E27
    resource "null_resource" "collection-events_null-resource_9F908E27" {
        id = "832091505403206886"
    }

  # null_resource.pocketeventbridge_listapievents_nullresource_0986E948 has moved to null_resource.list-api-events_null-resource_D711C801
    resource "null_resource" "list-api-events_null-resource_D711C801" {
        id = "4790634215299972220"
    }

  # null_resource.pocketeventbridge_premiumpurchase_nullresource_6D67F378 has moved to null_resource.premium-purchase_null-resource_E2C3B0AC
    resource "null_resource" "premium-purchase_null-resource_E2C3B0AC" {
        id = "2431405901146229294"
    }

  # null_resource.pocketeventbridge_prospectevents_nullresource_92CE41FC has moved to null_resource.prospect-events_null-resource_BF542108
    resource "null_resource" "prospect-events_null-resource_BF542108" {
        id = "73097855203687419"
    }

  # null_resource.pocketeventbridge_shareablelistevents_nullresource_E91C89D8 has moved to null_resource.shareable-list-events_null-resource_78AB9CC2
    resource "null_resource" "shareable-list-events_null-resource_78AB9CC2" {
        id = "7514281831826198604"
    }

  # null_resource.pocketeventbridge_shareablelistitemevents_nullresource_B57BD2A5 has moved to null_resource.shareable-list-item-events_null-resource_46056FE2
    resource "null_resource" "shareable-list-item-events_null-resource_46056FE2" {
        id = "7821674224914414466"
    }

  # null_resource.user-api-events will be created
  + resource "null_resource" "user-api-events" {
      + id = (known after apply)
    }

  # null_resource.pocketeventbridge_userapievents_nullresource_7F96C768 has moved to null_resource.user-api-events_null-resource_C0C836FA
    resource "null_resource" "user-api-events_null-resource_C0C836FA" {
        id = "2732232843318932070"
    }

  # null_resource.user-registration will be created
  + resource "null_resource" "user-registration" {
      + id = (known after apply)
    }

  # null_resource.pocketeventbridge_userregistration_nullresource_F1C77D27 has moved to null_resource.user-registration_null-resource_B04CACC3
    resource "null_resource" "user-registration_null-resource_B04CACC3" {
        id = "2164411739781809868"
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be created
  # (moved from pagerduty_service.pocketeventbridge_pagerduty_pagerdutycritical_22817B42)
  + resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "PocketEventBridge-Dev-PagerDuty-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "high"
        }
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be created
  # (moved from pagerduty_service.pocketeventbridge_pagerduty_pagerdutynoncritical_333AFE25)
  + resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Non-Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "PocketEventBridge-Dev-PagerDuty-Non-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "low"
        }
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 13 to add, 2 to change, 2 to destroy.
null_resource.user-api-events: Creating...
null_resource.user-api-events: Creation complete after 0s [id=1640281684023204663]
null_resource.user-registration: Creating...
null_resource.user-registration: Creation complete after 0s [id=1054849530497827920]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Non-Critical:8f1d27da-5169-4a2f-b880-6bbc667bfe80]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Critical:fb873b8b-c446-4f51-a418-01be715ad1ab]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_46A95BB9: Creating...
aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E: Creating...
aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Dev-User-Api-EventBridge-Rule_event-bridge-rule_CD10601E: Modifying... [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserEvents-Rule-Rule]
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Modifying... [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Dev-User-Api-EventBridge-Rule_event-bridge-rule_CD10601E: Modifications complete after 0s [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserEvents-Rule-Rule]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_46A95BB9: Creation complete after 0s [id=PocketEventBridge-Dev-Shared-Event-Bus/PocketEventBridge-Dev-UserMerge-Rule-Rule]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Dev-UserMerge-Rule-Target_464B97D5: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Creating...
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Creating...
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Dev-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Dev-UserMerge-Rule-Target_464B97D5: Creation complete after 0s [id=PocketEventBridge-Dev-Shared-Event-Bus-PocketEventBridge-Dev-UserMerge-Rule-Rule-AccountDeleteMonitor-Dev-UserMerge-Rule-Target]
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Modifications complete after 0s [id=PocketEventBridge-Dev-ShareableListEvents-Rule-dlq-alarm]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Creation complete after 1s [id=PB4TRMW]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Creation complete after 1s [id=PXV5RN6]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 0s [id=PW038Q0]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 0s [id=PZZR92Q]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 0s [id=PSQF7AA]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=POEU6LN]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 0s [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Critical:095550a0-ad2e-488f-8a65-ebf52e809a97]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 2s [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-Infrastructure-Alarm-Non-Critical:1840ffe4-8fd4-492b-b9b7-04bbf22e595a]
aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E: Still creating... [10s elapsed]
aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E: Still creating... [20s elapsed]
aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E: Creation complete after 25s [id=https://sqs.us-east-1.amazonaws.com/410318598490/ProspectAPI-Dev-Sqs-Translation-Queue]

Apply complete! Resources: 13 added, 2 changed, 2 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"964d3beb-9b6f-4615-90d0-3c5cd3f3b012","JobName":"pocket-event-bridge_infrastructure_apply_dev","PRNumber":97,"Program":"tfcmt","SHA1":"0ce1d7c0e884cd7a2058ee01d04e11bf35e68556","Target":"pocket-event-bridge-cdk-dev","Vars":{}} -->